# Doc: https://homebrew-file.readthedocs.io/en/latest/usage.html
# ===config===
# set arguments for all "brew install --cask" commands
cask_args appdir: "/Applications"

# ===tap===
tap "homebrew/cask"
tap "homebrew/core"
tap "microsoft/git" # credential-manager-core

# ===brew===
brew "pyenv", link: true
brew "wget" # for font installation
brew "reattach-to-user-namespace"
brew "telnet"

# ===cask===
cask "1password"
cask "alacritty"
cask "amethyst"
cask "orbstack"
cask "dropbox"
cask "freedom"
cask "git-credential-manager-core"
cask "gitify"
cask "google-japanese-ime"
cask "grammarly-desktop"
cask "keycastr"
cask "microsoft-edge"
cask "obs"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "tailscale-app"
cask "visual-studio-code"
